dotfiles/.archive/Desktop.org
#+title: Desktop Configuration
#+property: header-args:emacs-lisp :tangle .emacs.d/lisp/ri-desktop.el
#+auto_tangle: t
#+startup: content

* Intro

This file includes my EXWM configuration and packages to install using Guix, as well as general package configurations in =.config=.

* EXWM Window Management

EXWM wiki:
https://github.com/ch11ng/exwm/wiki

|----------+----------------------------------|
| Keybinds |                                  |
|----------+----------------------------------|
| C-c RET  | move window to another workspace |
|----------+----------------------------------|

notes:
- exwm-input-release-keyboard for char mode, manage-finish-hook, make a program auto.
- (interactive) is used for functions that are dependent on keybindings as well, like switch workspace!

to implement:
- make it so you can access and jump to any exwm buffer from any workspace
  - run ivy-switch-buffer starting with the name of current buffer.
- the reason why windows were glitching out was because opening ANY new window puts it into another workspace!!!
- make it so when any exwm window appears, switch to that workspace and focus on that buffer.
- char-mode line-mode toggle
- translation-map doesn't work on exwm buffers.
  - solution 1: create translation in exwm-mode-map.
  - solution 2: find a better way to translate keybinds.
- make it so char/line mode swap happens on the same keybind.
- make it so when a new window appears, switch to that workspace and focus on that buffer.
- in spawn librewolf, make it so if new window has the property of floating using xdotool, then don't move. if that's not an option, then check the name/title of the X window and compare names (the default should all be the same... i think... further experimentation is needed.

TODO:
- no guix package available (make my own and then contribute?):
  - exwm-mff
  - librewolf
- instead of having several manifest files in scheme, what about several text files with a list of strings, and use a script to create the actual manifest by printing the contents of all the manifests in a scheme manifest block (supports different manifests by machine too)

** variables, systray, resolution, enable

systray-addons, cursor, exwm-in-all-buffer-menus, xrandr resolution.

#+begin_src emacs-lisp

  (setup (:pkg exwm)
    ;; Systray addons
    (require 'exwm)
    (setq display-time-day-and-date t
          display-time-24hr-format t
          display-time-mode t
          display-battery-mode t
          display-time-default-load-average nil)
    (setq exwm-workspace-number 9 ; 0-8
          focus-follows-mouse nil ; click-to-focus
          ;; exwm-workspace-warp-cursor t ; ?
          exwm-debug t) ; enable for debug mode

    ;; See all X windows with exwm-switch-to-buffer, so can pull into current workspace
    (setq exwm-layout-show-all-buffers nil)

    ;; Display all EXWM buffers in every workspace buffer list
    ;; Could always have another keybind that shows all active EXWM buffers...
    (setq exwm-workspace-show-all-buffers nil) ; def nil, better?

    ;; Detach the minibuffer (restart req) (show it with exwm-workspace-toggle-minibuffer)
    (setq exwm-workspace-minibuffer-position nil)

    ;; set screen resolution (arandr to graphically extract xrandr command)
    ;;  (call before exwm-init!)
    (require 'exwm-randr)
    (exwm-randr-enable) ; set resolution before init.
    (start-process-shell-command "xrandr" nil "xrandr --output eDP-1 --primary --mode 1920x1080 --pos 0x0 --rotate normal --output HDMI-1 --off --output DP-1 --off --output DP-2 --off --output DP-3 --off --output DP-4 --off")

    ;; Load the system tray before exwm-init
    (require 'exwm-systemtray)
    (setq exwm-systemtray-height nil)
    (exwm-systemtray-enable)

    (exwm-enable))

#+end_src

*Guix Packages:*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; Emacs EXWM
  "emacs-exwm"
  ;; "emacs-desktop-environment"

#+end_src

** buffer renaming

#+begin_src emacs-lisp

  ;; -- buffer rename hooks ---

  (defun ri/exwm-update-class ()
    (exwm-workspace-rename-buffer (format "EXWM: %s" exwm-class-name)))

  ;; When window "class" updates, use it to set the buffer name
  (when ri/exwm-enabled
    (add-hook 'exwm-update-class-hook #'ri/exwm-update-class))

  (defun ri/exwm-update-title ()
    (pcase exwm-class-name
      ("librewolf" (exwm-workspace-rename-buffer (format "Librewolf: %s" exwm-title)))
      ("vterm" (exwm-workspace-rename-buffer (format "vterm: %s" exwm-title)))))

  ;; When window title updates, use it to set the buffer name
  (when ri/exwm-enabled
    (add-hook 'exwm-update-title-hook #'ri/exwm-update-title))

#+end_src

** helper functions (move more things into here!)

#+begin_src emacs-lisp

  ;; --- helper functions

  ;; need (interactive) ?
  (defun ri/run-in-background (command)
    (let ((command-parts (split-string command "[ ]+")))
      (apply #'call-process `(,(car command-parts) nil 0 nil ,@(cdr command-parts)))))

  (defun ri/position-window ()
    (let* ((pos (frame-position))
           (pos-x (car pos))
           (pos-y (cdr pos)))
      (exwm-floating-move (- pos-x) (- pos y))))

#+end_src

** init-hook

#+begin_src emacs-lisp

  ;; --- exwm startup functions ---

  ;; depends on nm-applet, pasystray(?), pavucontrol(?), and blueman
  (defun ri/exwm-init-hook ()
    ;; (with-eval-after-load ;'perspective
      ;; Make workspace 1 be the one where we land at startup
      (exwm-workspace-switch-create 0)
      ;; Launch programs at startup
      ;; (eshell)
      ;; Run programs in background at startup
      ;; (ri/run-in-background "nm-applet")
      ;; (ri/run-in-background "pasystray")
      ;; (ri/run-in-background "blueman-applet")
      ;; (ri/run-in-background "snixembed && iwgtk -i")
      (ri/run-in-background (concat user-emacs-directory "exwm/prepare-exwm.sh"))
      )

  ;; When EXWM starts up, run some functions
  (when ri/exwm-enabled
    (add-hook 'exwm-init-hook #'ri/exwm-init-hook))

#+end_src

** Keybinds
*** helper functions (workspaces)

#+begin_src emacs-lisp

  ;; --- commands for navigating workspaces ---

  ;; switch to last workspace (hack)
  (defvar ri/exwm-workspace--switch-history-hack (cons exwm-workspace-current-index '()))
  (defun ri/exwm-workspace-switch-to-last ()
    "Switch to the workspace that was used before current workspace"
    (interactive)
    (exwm-workspace-switch (cdr ri/exwm-workspace--switch-history-hack)))
  ;;
  (defun ri/exwm-workspace-switch-to-last-hack ()
    "Save location of current workspace when switching, so it can be used by switch-to-last"
    (interactive)
    (message " [%s]" exwm-workspace-current-index)
    (setq ri/exwm-workspace--switch-history-hack
          (cons exwm-workspace-current-index
                (car ri/exwm-workspace--switch-history-hack))))
  ;;
  (when ri/exwm-enabled
    (add-hook 'exwm-workspace-switch-hook #'ri/exwm-workspace-switch-to-last-hack))

  ;; if workspace switch to the same one, go to the last one

  ;; switch to next workspace
  (defun ri/exwm-workspace-switch-to-next ()
    "Switch to the next workspace"
    (interactive)
    (exwm-workspace-switch (+ exwm-workspace-current-index 1)))

  ;; switch to previous workspace
  (defun ri/exwm-workspace-switch-to-previous ()
    "Switch to the previous workspace"
    (interactive)
    (exwm-workspace-switch (- exwm-workspace-current-index 1)))

  ;; switch to last window (any frame inclusive)
  (defun ri/switch-to-last-window-any-frame ()
    "Switch to the last window, including "
    (interactive)
    (let ((win (get-mru-window t t t)))
      (unless win (error "Last window not found"))
      (let ((frame (window-frame win)))
        (select-frame-set-input-focus frame)
        (select-window win))))

  ;; switch to last window (unused)
  (defvar ri/last-window-direction 1)
  (defun ri/switch-to-last-window ()
    (interactive)
    (other-window ri/last-window-direction)
    (setq ri/last-window-direction (- 0 ri/last-window-direction)))

#+end_src

