dotfiles/emacs-old/.config/oldmacs.d/lisp/ri-desktop.el
  ;; translate "s-`" to "s-0" so that i can access workspace zero (for non-DVP)
  (define-key key-translation-map (kbd "s-`") (kbd "s-0"))

  ;; an alist of dvp keybinds (car) to key-translation-map to (cdr)
  (setq ri/dvp-super-translation-alist
        '(("s-$" . "s-0")
          ("s-&" . "s-1")
          ("s-[" . "s-2")
          ("s-{" . "s-3")
          ("s-}" . "s-4")
          ("s-(" . "s-5")
          ("s-=" . "s-6")
          ("s-*" . "s-7")
          ("s-)" . "s-8")
          ("s-+" . "s-9")
          ("s-]" . "s-0")))
  ;; perform dvp key-translation map
  (cl-loop for (input . output) in ri/dvp-super-translation-alist
           do (define-key key-translation-map (kbd input) (kbd output)))
  ;; (mapcar (lambda (pair)
  ;;           (let ((input (car pair))
  ;;                 (output (cdr pair)))
  ;;             (define-key key-translation-map (kbd input) (kbd output))))
  ;;         ri/dvp-super-translation-alist)

  ;; send to emacs instead of X application
  (setq exwm-input-prefix-keys
        '(?\M-x
          ?\M-:
          ?\M-` ; text-mode menubar
          ?\M-o
          ?\M-& ; async-shell command
          ?\C-x
          ?\C-h
          ?\C-u ; new C-x
          ?\C-\M-- ; does this even work?
          ?\C-\M-g ; does this even work?
          ?\s-`     ;; for translate "s-`" to "s-0" hack
          ?\C-\M-\)  ;; for adjust/move windows
          ?\s-\M-t  ;; last workspace
          ?\s-\M-h  ;; prev workspace
          ?\s-\M-s  ;; next workspace
          ?\C-\     ;; C-<space> (open application)
          ?\s-\C-L ; Enter Hibernation
          ;; dvorak accomidations
          ?\s-$
          ?\s-&
          ?\s-\[
          ?\s-{
          ?\s-}
          ?\s-\(
          ?\s-=
          ?\s-*
          ?\s-\)
          ?\s-+
          ?\s-\]
          ))

  ;; C-q to send next key to X-applicaiton
  (define-key exwm-mode-map [?\C-q] 'exwm-input-send-next-key)

  ;; Already auto-defined???
  ;; (define-key exwm-mode-map (kbd "C-c <return>") 'exwm-workspace-move-window)

  ;; Set up global key bindings.  These always work, no matter the input state!
  ;; Keep in mind that changing this list after EXWM initializes has no effect.
  (setq exwm-input-global-keys
        `(,@
          ;; 's-N': Switch to certain workspace with Super (Win) plus a number key (0 - 9)
          (mapcar (lambda (i)
                    `(,(kbd (format "s-%d" i)) .
                      (lambda ()
                        (interactive)
                        ;; if input is same as current workspace, go to last
                        (if (eq ,i exwm-workspace-current-index)
                            (ri/exwm-workspace-switch-to-last)
                          (exwm-workspace-switch-create ,i)))))
                  (number-sequence 0 9))

          ;; Reset to line-mode
          ;; (C-c C-k switches to char-mode via exwm-input-release-keyboard)
          (,(kbd "s-r") . exwm-reset)

          ;; Move between windows
          (,(kbd "s-h") . windmove-left)
          (,(kbd "s-t") . windmove-up)
          (,(kbd "s-n") . windmove-down)
          (,(kbd "s-s") . windmove-right)

          ;; Move windows
          (,(kbd "s-H") . windmove-swap-states-left)
          (,(kbd "s-T") . windmove-swap-states-up)
          (,(kbd "s-N") . windmove-swap-states-down)
          (,(kbd "s-S") . windmove-swap-states-right)

          ;; Shortcuts for windows
          (,(kbd "s-g") . (lambda () (interactive) (other-window -1)))
          (,(kbd "s-c") . (lambda () (interactive) (other-window 1)))
          (,(kbd "s-d") . delete-window)

          ;; alternatively, s-g + s-S-g for windows, and s-c for launcher or sum (comfy?)
          ;; or maybe s-o for windows and s-u s-i for buffers?

          ;; buffers and more
          (,(kbd "s-o") . meow-last-buffer)
          (,(kbd "s-b") . counsel-switch-buffer)

          ;; Toggles
          (,(kbd "s-F") . exwm-floating-toggle-floating)
          (,(kbd "s-f") . exwm-layout-toggle-fullscreen)
          (,(kbd "s-m") . exwm-layout-toggle-mode-line)

          ;; Launch applications via shell command
          (,(kbd "s-a") . (lambda (command)
                            (interactive (list (read-shell-command "$ ")))
                            (start-process-shell-command command nil command)))

          ;; Special
          (,(kbd "s-C-H") . (lambda () (interactive)
                              (start-process-shell-command "hibernate" nil
                                                           "loginctl hibernate")))
          (,(kbd "s-C-L") . (lambda () (interactive)
                              (desktop-environment-lock-screen)))

          ;; Switch workspace
          (,(kbd "s-w") . exwm-workspace-switch)
          (,(kbd "s-M-t") . ri/exwm-workspace-switch-to-last)
          (,(kbd "s-M-h") . (lambda () (interactive) (ri/exwm-workspace-switch-to-previous)))
          (,(kbd "s-M-s") . (lambda () (interactive) (ri/exwm-workspace-switch-to-next)))

          ))

  (exwm-input-set-key (kbd "s-<tab>") 'ri/exwm-workspace-switch-to-last)
  (exwm-input-set-key (kbd "s-SPC") 'counsel-linux-app)
  (exwm-input-set-key (kbd "s-<return>") 'multi-vterm-dedicated-toggle))
