dotfiles/emacs-old/.config/oldmacs.d/lisp/ri-desktop.el

;; if game has trouble put it in exwm-input-release-keyboard, and then s-r to reset.
;; shrink and expand windows...
;; spawn mpv in corner of screen so can watch youtube video.
;; make function keys work in fullscreen... always pass to emacs instead of exwm.
;; move focus onto popup window.

;; Run when startup floating window
;;  (happens before exwm-manage-finish-hook (configure-window-startup))
(defun ri/exwm-configure-floating-setup ()
  (interactive)
  (exwm-layout-hide-mode-line))

;; Hide the modeline on all floating windows
(when ri/exwm-enabled
  (add-hook 'exwm-floating-setup-hook #'ri/exwm-configure-floating-setup))

;; does this even work?
(defun ri/exwm--custom-switch-to-buffer (buffer-or-name)
  (interactive)
  ;; if on EXWM buffer.
  (if (eq exwm--frame exwm-workspace--current)
      ;; On the current workspace/not floating.
      (if (not exwm--floating-frame)
          (switch-to-buffer buffer-or-name)
        ;; Select the floating frame.
        (message "DEBUG in exwm-workspace-switch-to-buffer: is a floating frame on current workspace")
        (select-frame-set-input-focus exwm--floating-frame)
        (select-window (frame-root-window exwm--floating-frame)))
    ;; On another workspace/floating (below is always off)
    (if exwm-layout-show-all-buffers
        (exwm-workspace-move-window exwm-workspace--current
                                    exwm--id)
      (let ((window (get-buffer-window buffer-or-name exwm--frame)))
        (if window
            (set-frame-parameter exwm--frame
                                 'exwm-selected-window window)
          (message "DEBUG in exwm-workspace-switch-to-buffer: another wksp: %s" exwm--frame)
          (set-window-buffer (frame-selected-window exwm--frame)
                             buffer-or-name)))
      (exwm-workspace-switch exwm--frame))))

;; (define-key exwm-mode-map (kbd "C-c C-o")
;;   (lambda () (interactive)
;;     ;; ri/exwm--custom-previous-floating-frame
;;     (select-frame-set-input-focus ri/exwm--custom-previous-floating-frame)
;;     (select-window (frame-root-window ri/exwm--custom-previous-floating-frame))
;;     ))

;; Run when startup any window
;;  Enable (interactive) ?
(defun ri/exwm-configure-window-startup ()
  (interactive)
  (message "Window '%s' appeared!" exwm-class-name)
  (pcase exwm-class-name
    ("mpv" (exwm-floating-toggle-floating))
    ))

;; Configure windows as they're created (includes spawn in certain wkspaces)
;; For automoving to workspace, use a function.
(when ri/exwm-enabled
  (add-hook 'exwm-manage-finish-hook #'ri/exwm-configure-window-startup))

(defvar apps-num-alist '((discord   . 6)
                         (steam     . 7)
                         (spotify   . 8)
                         (librewolf . 3)
                         (firefox   . 2)
                         (keepassxc . 5))
  "Workspace index associated to application.")

(defun get-apps-num-alist-num (name) 
  (cdr (assoc name apps-num-alist)))

(defvar apps-bind-alist '((discord   . "d")
                          (steam     . "c")
                          (spotify   . "s")
                          (librewolf . "l")
                          (keepassxc . "p")
                          (firefox   . "f"))
  "Last letter of keybind for each application.")

(defvar apps-run-alist '((discord   . ri/run-discord)
                         (steam     . ri/run-steam)
                         (spotify   . ri/run-spotify)
                         (librewolf . ri/run-librewolf)
                         (keepassxc . ri/run-keepassxc)
                         (firefox   . ri/run-firefox))
  "Run command for starting")

;; only run this function (called by hook) if the variable is true.
(defvar ri/open-app-in-alist-workspace nil)
(defun ri/exwm-custom-configure-window-startup ()
  "If a window starts up and the variable is enabled, run the following"
  (interactive)
  (message "DEBUG: Entering custom-config-window-startup hook")
  (if (eq ri/open-app-in-alist-workspace t)
      ;; for KeePassXC, when you try to autofill when the database is locked,
      ;; it will pop up a new window in the current workspace, but
      ;; `exwm-workspace-move-window' will move it elsewhere... except it
      ;; doesn't... and it will fail to autoselect the floating window/frame.
      ;; So to prevent this, the below is used:
      (progn
        (unless (equal exwm-title "Unlock Database - KeePassXC")
          (cl-loop for (name . num) in apps-num-alist
                   do (when (equal exwm-class-name name)
                        (exwm-workspace-move-window
                         (get-apps-num-alist-num exwm-class-name)))))
        (setq ri/open-app-in-alist-workspace nil))))

(defun ri/run-discord ()
  (interactive)
  (setq ri/open-app-in-alist-workspace t)
  (ri/run-in-background "flatpak run com.discordapp.Discord")
  (exwm-workspace-switch-create
   (get-apps-num-alist-num 'discord)))
;;
(defun ri/run-spotify ()
  (interactive)
  (setq ri/open-app-in-alist-workspace t)
  (ri/run-in-background "flatpak run com.spotify.Client")
  (exwm-workspace-switch-create
   (get-apps-num-alist-num 'spotify)))
;;
(defun ri/run-librewolf ()
  (interactive)
  (setq ri/open-app-in-alist-workspace t)
  (ri/run-in-background "flatpak run io.gitlab.librewolf-community")
  (exwm-workspace-switch-create
   (get-apps-num-alist-num 'librewolf)))
;;
(defun ri/run-keepassxc ()
  (interactive)
  (setq ri/open-app-in-alist-workspace t)
  (ri/run-in-background "~/.bin/firejail-guix-run keepassxc")
  (exwm-workspace-switch-create
   (get-apps-num-alist-num 'keepassxc)))
;;
(defun ri/run-firefox ()
  (interactive)
  (setq ri/open-app-in-alist-workspace t)
  (ri/run-in-background "firefox")
  ;; (ri/run-in-background "~/.bin/firejail-guix-run firefox")
  (exwm-workspace-switch-create
   (get-apps-num-alist-num 'firefox)))
;;
(defun ri/run-steam ()
  (interactive)
  (setq ri/open-app-in-alist-workspace t)
  (ri/run-in-background "flatpak run com.valvesoftware.Steam")
  (exwm-workspace-switch-create
   (get-apps-num-alist-num 'steam)))

;; ------------------------------------------------------------

(when ri/exwm-enabled
  ;; binds "s-l *" to run ri/run-____ command
  (cl-loop for (app . bind-char) in apps-bind-alist
           do
           (exwm-input-set-key (kbd (concat "s-l " bind-char))
                               (cdr (assoc app apps-run-alist))))

  ;; binds "s-L *" to switch to associated workspace
  ;; (defvar ri/app-launch-input nil)
  ;; (cl-loop for (app-bind . bind-char) in apps-bind-alist
  ;;          for (app-num . num) in apps-num-alist
  ;;          do
  ;;          (exwm-input-set-key (kbd (concat "s-L " bind-char))
  ;;                              (lambda ()
  ;;                                (interactive)
  ;;                                `(exwm-workspace-switch-create ,num))))
  )

;; (exwm-input-set-key (kbd "s-L d") (lambda () (interactive) (exwm-workspace-switch-create 6)))

;; --------------------

;; run the function when a new exwm window appears
(when ri/exwm-enabled
  (add-hook 'exwm-manage-finish-hook #'ri/exwm-custom-configure-window-startup))

;; very annoying?
;; makes the cursor visible?
;; only warp when on X window buffer!
;; warps useful when on EXWM-mode with pop-ups
;; when on EXWM, enable mouse. When on emacs, disable mouse.
(use-package exwm-mff
  :config
  (exwm-mff-mode nil))
;; ^ should already be nil...

;; warp cursor to center when switch to a X window buffer.
(when ri/exwm-enabled
  (add-hook 'exwm-manage-finish-hook (lambda () (exwm-mff-warp-to-selected))))
