dotfiles/.archive/Desktop.org
** wallpaper, cosmetics, setup

#+begin_src emacs-lisp

  ;; set wallpaper (after xrandr so can get correct dimensions)
  (defun ri/set-wallpaper ()
    (interactive)
    (let ((def-wallpaper-path (concat user-emacs-directory "exwm/oneshot-wallpaper3.jpg"))
          (home-wallpaper-path "~/.fehbg"))
      (if (file-exists-p home-wallpaper-path)
          (progn
            (start-process-shell-command
             "feh" nil (concat "sh " "~/.fehbg")))
        (progn
          (start-process-shell-command
           "feh" nil
           (concat "feh --bg-fill " def-wallpaper-path))))))

  ;; random wallpaper
  ;; (defun ri/random-wallpaper ()
  ;;   (interactive))

  (when ri/exwm-enabled
    ;; night light
    ;; (ri/run-in-background (expand-file-name "exwm/sct-auto-adjust.sh" user-emacs-directory))
    ;; run prepare-exwm.sh
    ;; (no longer needed since .xsession works)
    ;; (ri/run-in-background (expand-file-name "exwm/prepare-exwm.sh" user-emacs-directory))
    ;; wallpaper
    (ri/set-wallpaper))

#+end_src

** desktop-environment

#+begin_src emacs-lisp

  ;; depends on scrot (screenshot), brightnessctl (brightness), and playerctl (player)
  (use-package desktop-environment
    :after exwm
    :config
    (setq desktop-environment-update-exwm-global-keys :global)
    (unbind-key "s-l" desktop-environment-mode-map)
    (desktop-environment-mode)
    :custom
    ;; brightness
    (desktop-environment-brightness-normal-increment "10%+")
    (desktop-environment-brightness-normal-decrement "10%-")
    (desktop-environment-brightness-small-increment "5%+")
    (desktop-environment-brightness-small-decrement "5%-")
    ;; volume
    (desktop-environment-volume-normal-decrement "-10%")
    (desktop-environment-volume-normal-increment "+10%")
    (desktop-environment-volume-small-decrement "-5%")
    (desktop-environment-volume-small-increment "+5%")
    (desktop-environment-volume-set-command "sh ~/.emacs.d/exwm/pactl-increment-volume.sh %s")
    (desktop-environment-volume-get-command "sh ~/.emacs.d/exwm/pactl-print-volume-w-mute.sh")
    (desktop-environment-volume-get-regexp "\\(.*\\)")
    (desktop-environment-volume-toggle-command "pactl set-sink-mute @DEFAULT_SINK@ toggle && bash ~/.emacs.d/exwm/pactl-print-mute.sh")
    (desktop-environment-volume-toggle-regexp "\\(.*\\)" )
    ;; screenshot
    (desktop-environment-screenshot-command "flameshot gui"))

#+end_src

*Guix Packages:*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  "emacs-desktop-environment"

#+end_src

** Ivy-posframe

#+begin_src emacs-lisp

  ;; for floating minibuffer...
  ;; ; maybe have disappearing minibuffer above the modeline?
  ;; ; show minibuffer in separate frame?
  ;; ; show minibuffer on polybar? make it pop up from under polybar?
  ;; ; auto-hiding minibuffer at top of screen, and posframe for all else but quit.
  ;; ; polybar at top, print minibuffer messages, stable, bottom is only modeline

  (use-package ivy-posframe
    :disabled
    :after (exwm)
    :config
    (setq ivy-posframe-height-alist '((swiper . 20)
                                      (counsel-M-x . 40)))

    (setq ivy-posframe-display-functions-alist
          '((swiper          . ivy-display-function-fallback)
           ;; (counsel-M-x    . ivy-posframe-display-at-window-bottom-left)
            (counsel-M-x     . ivy-display-function-fallback)
            (counsel-switch-buffer . ivy-display-function-fallback)
            (complete-symbol . ivy-posframe-display-at-point)
            (t               . ivy-posframe-display)))
    ;; (setq ivy-posframe-display-functions-alist '((t . ivy-posframe-display-at-frame-center)))
    ;; (setq ivy-posframe-display-functions-alist '((t . ivy-posframe-display-at-window-center)))
    ;; (setq ivy-posframe-display-functions-alist '((t . ivy-posframe-display-at-frame-bottom-left)))
    ;; (setq ivy-posframe-display-functions-alist '((t . ivy-posframe-display-at-window-bottom-left)))
    ;; (setq ivy-posframe-display-functions-alist '((t . ivy-posframe-display-at-frame-top-center)))
    (ivy-posframe-mode 0))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  "emacs-ivy-posframe"

#+end_src

** External files

Non elisp stuff (simply output into the respective directories)

*** EXWM Launcher

xinitrc is not in a literate config file as of now.

**** prepare-exwm.sh

The below runs a bunch of commands that needs to be run before starting exwm. Commands like xmodmap, picom, xsettingsd, and key repeat speed.

#+begin_src shell :tangle .emacs.d/exwm/prepare-exwm.sh :shebang #!/bin/sh

  # This script is configured in Desktop.org

  Run() {
      if $(which $1 >/dev/null 2>&1 ; echo $?); then
          $@ &
      else
          echo "Command not found: $@" >> ~/.my-wm-errors.log
      fi
  }

  if [ "$PREPARE_EXWM_SCRIPT_RAN" -eq "1" ]; then
      echo "DEBUG: ran prepare-exwm.sh twice!"
      exit 0
  fi

  # Set screen DPI (for high DPI displays) (before compton)
  #xrdb ~/.emacs.d/exwm/Xresources

  # set up dvorak and nocaps (symbols: compose:sclk)
  # (only run if not in guix system, because otherwise will be configured).
  if ! [ $(cat /etc/*-release | grep "^ID=" | sed "s/.*=//") == "guix" ]; then
      setxkbmap -layout 'us,us' -variant 'dvp,' -option grp:sclk_toggle ctrl:nocaps
  fi

  # binds S-<Ctrl> to escape (might break functionality!) and remove caps (not needed).
  #xmodmap ~/.emacs*/exwm/Xmodmap

  # make menu super
  xmodmap -e "keysym Menu = Super_R"

  # if laptop is thinkpad, load special keybinds
  if grep -q "ThinkPad L520" "/sys/devices/virtual/dmi/id/product_family"; then
      xmodmap ~/.emacs*/exwm/Xmodmap-thinkpad
  fi

  # set hold type startup and speed (delay rate)
  # xset r rate 240 60
  xset r rate 220 70

  # set cursor type (what if not enabled?)
  xsetroot -cursor_name left_ptr

  # Screen compositor
  picom &

  # set screen temperature
  [ -f "$HOME/.bin/sct-auto-adjust.sh" ] && ~/.bin/sct-auto-adjust.sh &

  # Enable screen locking on suspend
  # xss-lock -- slock &

  # run xsettingsd
  xsettingsd &

  # dunst notifications
  dunst &

  # nm-applet
  nm-applet &

  # volume systray applet
  pasystray &

  # numlock on
  numlockx &

#+end_src

**** start-exwm.sh

#+begin_src shell :tangle .emacs.d/exwm/start-exwm.sh :shebang #!/bin/sh

  # This script is configured in Desktop.org

  # Start Emacs w/ EXWM
  # exec dbus-launch --sh-syntax --exit-with-session emacs -q --load "~/.emacs.d/init.el" -mm --debug-init -l ~/.emacs.d/desktop.el
  exec dbus-launch --sh-syntax --exit-with-session emacs -q --load "~/.emacs.d/init.el" -mm --debug-init --start-exwm

#+end_src

**** xsession file (disabled)

This file will be prioritized over any .desktop files.

Maybe in order to launch exwm from any location, i must source all the profiles at the beginning? Like in daviwil's config? I should try this in the future.
~.xsession~

#+begin_src shell :tangle .xsession :shebang #!/bin/sh

  exec dbus-launch --exit-with-session stumpwm

  # This file is configured in Desktop.org

  # ~/.emacs.d/exwm/prepare-exwm.sh # run startup commands

  # exec dbus-launch --exit-with-session emacs --start-exwm # much faster!!

#+end_src

**** .desktop file

For login manager.

*You must create a symbolic link with the command for xsessions file!*

#+begin_src sh :tangle no

  doas ln -f ~/.emacs.d/exwm/EXWM.desktop /usr/share/xsessions/EXWM.desktop

#+end_src

#+begin_src shell :tangle .emacs.d/exwm/EXWM.desktop

  [Desktop Entry]
  Name=EXWM
  Comment=Emacs Window Manager
  Exec=sh /home/mio/.emacs.d/exwm/start-exwm.sh
  TryExec=sh
  Type=Application
  X-LightDM-DesktopName=exwm
  DesktopName=exwm

#+end_src

Note: you are using Guix System, the execute command must be exwm, not emacs.
This is what the default desktop file in =/run/current-system/profile/share/xsessions/exwm.desktop= might look like:
#+begin_src desktop :tangle no
[Desktop Entry]
Type=Application
Name=emacs-exwm
Comment=Emacs X window manager
Exec=/gnu/store/a420wvmwx38n0xihig7dwh4xpkv0ri9d-emacs-exwm-0.27/bin/exwm
TryExec=/gnu/store/a420wvmwx38n0xihig7dwh4xpkv0ri9d-emacs-exwm-0.27/bin/exwm
#+end_src

*** pactl volume set and get

*Set/increment volume and prevent if too loud*

#+begin_src shell :tangle .emacs.d/exwm/pactl-increment-volume.sh :shebang #!/bin/sh

  volume=$(pactl get-sink-volume @DEFAULT_SINK@ | awk '{print $5}' | sed s/%//) # e.g. 60
  origInput="$1" # e.g. +5%
  posOrNeg=$(echo $origInput | awk '{print substr($0,0,1)}') # e.g. +
  input=${origInput//[!0-9]/} # e.g. 5

  if [[ "$posOrNeg" == "+" ]]; then
      newVol=$(($volume + $input)) # e.g. 65
  elif [[ "$posOrNeg" == "-" ]]; then
      newVol=$(($volume - $input)) # e.g. 65
  else
      echo "input doesn't contain + or - !!"
      exit 1
  fi

  if [[ "$newVol" -le "100" ]]; then
      pactl set-sink-volume @DEFAULT_SINK@ $posOrNeg$input%
  fi

#+end_src

*Prints current volume and "mute" if muted:*

#+begin_src shell :tangle .emacs.d/exwm/pactl-print-volume-w-mute.sh :shebang #!/bin/sh

  volume=$(pactl get-sink-volume @DEFAULT_SINK@ | awk '{print $5}' | sed s/%//)
  muted=$(pactl get-sink-mute @DEFAULT_SINK@ | awk '{print $2}')

  if [[ "$muted" == "yes" ]]; then
          echo "$volume | muted "
  else
          echo "$volume"
  fi

#+end_src


*Prints the current mute status when toggling:*

#+begin_src shell :tangle .emacs.d/exwm/pactl-print-mute.sh :shebang #!/bin/sh

  muted=$(pactl get-sink-mute @DEFAULT_SINK@ | awk '{print $2}')

  if [[ "$muted" == "yes" ]]; then
      echo "MUTED"
  else
      echo "ENABLED"
  fi

#+end_src

*** Keyboard remapping

#+begin_src conf-unix :tangle .emacs.d/exwm/Xmodmap

  # clear lock
  # keycode 66 = Control_L Escape

  keysym Menu = Super_R

#+end_src

*** High DPI screens

#+begin_src shell :tangle .emacs.d/exwm/Xresources

  Xft:dpi:  100  # set this to your desired DPI

#+end_src

* Stumpwm

** guix packages

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  "stumpwm:lib" ; doesn't work if system-installed...? (only when loading modules? wtf?)
  ;; "sbcl-slynk" ; slime instead? ; stumpwm-with-slynk installed in system profile.
  "stumpish" ; stumpwm interactive shell for stumpwm-mode
  "sbcl-clx-xembed" ; stumptray depd
  "snixembed" ; stumptray depd???

#+end_src

** Config

The StumpWM config file is defined in a separate org document:
[[file:.stumpwm.d/README.org][<Link to Config>]]

* System Configurations

unix applications go here
+ firejail
move these to desktop instead of Emacs? might create bloat
Move these to systems!!!

** Fonts and Themes

*** fonts.conf

need to specify fonts location to be able to access them from the desktop profile

tangle to .config/fontconfig/fonts.conf

#+begin_src xml :tangle .config/fontconfig/fonts.conf

  <?xml version="1.0"?>
  <!--This file is configured in Desktop.org!-->
  <!DOCTYPE fontconfig SYSTEM "fonts.dtd">
  <fontconfig>
    <dir>~/.guix-extra-profiles/desktop/desktop/share/fonts</dir>
  </fontconfig>

#+end_src

*** xsettingsd

Use [[https://codeberg.org/derat/xsettingsd][xsettingsd]] to configure gtk themes, font antialiasing/hinting, and UI sound effects.

Use dump_xsettings to get settings from current session... read docs for more!

: gsettings get org.gnome.desktop.interface

tangle to  .config/xsettingsd/xsettingsd.conf

#+begin_src conf :tangle .config/xsettingsd/xsettingsd.conf

  ## Theme:
  Net/ThemeName "Matcha-dark-azul"  ## widget theme
  Net/IconThemeName "Papirus-Dark"  ## icon theme
  ## GTK3
  # Gtk/DecorationLayout "menu:minimize,maximize,close"
  # Gtk/FontName "Cantarell 11"
  # Gtk/MonospaceFontName "Fira Mono 10"
  # Gtk/CursorThemeName "Adwaita"
  ## Xft
  # Xft/Antialias 1
  # Xft/Hinting 0
  # Xft/HintStyle "hintnone"
  # Xft/DPI <<dpi()>> # 1024 * DPI

#+end_src

*** GTK2 config (disabled)

GTK2 has to be configured with =.gtkrc-2.0= i think.

tangle to .gtkrc-2.0

#+begin_src conf-unix :tangle no

  # ~/.gtkrc-2.0

  gtk-can-change-accels = 1

  gtk-icon-theme-name = "Papirus-dark"
  gtk-theme-name = "Matcha-dark-azul"

  style "user-font"
  {
          font_name="Terminus 12"
  }
  widget_class "*" style "user-font"
  gtk-font-name = "Terminus 12"

#+end_src

