dotfiles/emacs-old/.config/oldmacs.d/lisp/ri-desktop.el

;; set wallpaper (after xrandr so can get correct dimensions)
(defun ri/set-wallpaper ()
  (interactive)
  (let ((def-wallpaper-path (concat user-emacs-directory "exwm/oneshot-wallpaper3.jpg"))
        (home-wallpaper-path "~/.fehbg"))
    (if (file-exists-p home-wallpaper-path)
        (progn
          (start-process-shell-command
           "feh" nil (concat "sh " "~/.fehbg")))
      (progn
        (start-process-shell-command
         "feh" nil
         (concat "feh --bg-fill " def-wallpaper-path))))))

;; random wallpaper
;; (defun ri/random-wallpaper ()
;;   (interactive))

(when ri/exwm-enabled
  ;; night light
  ;; (ri/run-in-background (expand-file-name "exwm/sct-auto-adjust.sh" user-emacs-directory))
  ;; run prepare-exwm.sh
  ;; (no longer needed since .xsession works)
  ;; (ri/run-in-background (expand-file-name "exwm/prepare-exwm.sh" user-emacs-directory))
  ;; wallpaper
  (ri/set-wallpaper))

;; depends on scrot (screenshot), brightnessctl (brightness), and playerctl (player)
(use-package desktop-environment
  :after exwm
  :config
  (setq desktop-environment-update-exwm-global-keys :global)
  (unbind-key "s-l" desktop-environment-mode-map)
  (desktop-environment-mode)
  :custom
  ;; brightness
  (desktop-environment-brightness-normal-increment "10%+")
  (desktop-environment-brightness-normal-decrement "10%-")
  (desktop-environment-brightness-small-increment "5%+")
  (desktop-environment-brightness-small-decrement "5%-")
  ;; volume
  (desktop-environment-volume-normal-decrement "-10%")
  (desktop-environment-volume-normal-increment "+10%")
  (desktop-environment-volume-small-decrement "-5%")
  (desktop-environment-volume-small-increment "+5%")
  (desktop-environment-volume-set-command "sh ~/.emacs.d/exwm/pactl-increment-volume.sh %s")
  (desktop-environment-volume-get-command "sh ~/.emacs.d/exwm/pactl-print-volume-w-mute.sh")
  (desktop-environment-volume-get-regexp "\\(.*\\)")
  (desktop-environment-volume-toggle-command "pactl set-sink-mute @DEFAULT_SINK@ toggle && bash ~/.emacs.d/exwm/pactl-print-mute.sh")
  (desktop-environment-volume-toggle-regexp "\\(.*\\)" )
  ;; screenshot
  (desktop-environment-screenshot-command "flameshot gui"))

;; for floating minibuffer...
;; ; maybe have disappearing minibuffer above the modeline?
;; ; show minibuffer in separate frame?
;; ; show minibuffer on polybar? make it pop up from under polybar?
;; ; auto-hiding minibuffer at top of screen, and posframe for all else but quit.
;; ; polybar at top, print minibuffer messages, stable, bottom is only modeline

(use-package ivy-posframe
  :disabled
  :after (exwm)
  :config
  (setq ivy-posframe-height-alist '((swiper . 20)
                                    (counsel-M-x . 40)))

  (setq ivy-posframe-display-functions-alist
        '((swiper          . ivy-display-function-fallback)
         ;; (counsel-M-x    . ivy-posframe-display-at-window-bottom-left)
          (counsel-M-x     . ivy-display-function-fallback)
          (counsel-switch-buffer . ivy-display-function-fallback)
          (complete-symbol . ivy-posframe-display-at-point)
          (t               . ivy-posframe-display)))
  ;; (setq ivy-posframe-display-functions-alist '((t . ivy-posframe-display-at-frame-center)))
  ;; (setq ivy-posframe-display-functions-alist '((t . ivy-posframe-display-at-window-center)))
  ;; (setq ivy-posframe-display-functions-alist '((t . ivy-posframe-display-at-frame-bottom-left)))
  ;; (setq ivy-posframe-display-functions-alist '((t . ivy-posframe-display-at-window-bottom-left)))
  ;; (setq ivy-posframe-display-functions-alist '((t . ivy-posframe-display-at-frame-top-center)))
  (ivy-posframe-mode 0))
