dotfiles/.archive/Desktop.org
**** firejail runscript for Guix packages (and Nix?)

Here are the debug logs i saw that seemed slightly unusual/problematic (running Firefox in firejail):
#+begin_example
Warning: /usr/bin/xdg-dbus-proxy was not found, downgrading dbus-user policy to allow.
To enable DBus filtering, install xdg-bus-proxy program.
Ignoring "dbus-user.talk org.freedesktop.Notifications" and 3 other dbus-user filter rules.
Error: dumpable process
Remove read permission on fseccomp executable
Warning: cannot find /var/run/utmp
Remove read permission on fsec-optimize executable
#+end_example

Ways to improve script below:
- create two arrays, keep adding parameters to first array. If "--" exists, add the rest to the second array. if second array is empty, set the first array to program and parameters, and set $program to first element, shift array, then set to program parameters only. If "--" exists, set first array to firejail params, then the second array as program and parameters only. Then repeat what happened earlier.
- i actually dont need the separator. just append it all to firejail.

#+begin_src shell :tangle no 

  ## NOTE: parameters like --ignore="net eth0" will not work.
  #  it will be interpreted to ( --ignore=net eth ).

  ## This one is too complex... share the other one.

  # create a tmpfile and delete if exit
  tmpfile=$(mktemp)
  trap 'rm -f "$tmpfile"' EXIT

  die() { echo -e "\n$* exiting..." 1>&2 ; exit 1; }

  params=( "$@" )

  # process parameters
  process_params() {
      # panic if no params
      [ "${#params[@]}" -eq 0 ] && die "no inputs provided."
      # go through each param to identify firejail --profile and program name/path
      local count=0
      for i in "${params[@]}"; do
  	# if match, use explicit firejail --profile=$(params[count])
  	if [ "$(echo $i| grep -c -- '--profile=')" -eq 1 ]; then
              profile="$i"
  	    params[count]="" # get rid of arg from params bc $profile will prepend it
  	fi
  	# first non-arg (regex: '[^-]') is program name/path
  	if [ "$(echo $i| grep -c '^[^-]')" -eq 1 ]; then
              program="$i"
  	    paramsProgramIndex=$count # later replace element with $binaryPath 
              break; # can break bc "--profile=" shouldn't appear after $program
  	fi
  	(( count++ ))
      done
      # panic if program couldn't be identified
      [ "$program" = "" ] && die "no program name or path supplied."
      # automatically define --profile=<program> if not in params
      if [ "$profile" = "" ]; then
  	profile="--profile=$(basename $(which $program))"
      fi
  }

  # identify wrapper script and copy it to tmpfile
  copy_script() {
      # not sure if this is necessary but might as well
      # [ -f "$HOME/.profile" ] && . ~/.profile
      # get path to wrapper script
      wrapperPath=$(which "$program") || die "program not found in path."
      # copy script to tmpfile
      cp $wrapperPath $tmpfile || die "cant copy wrapper script to tmpfile."
  }

  # modify the copied wrapper script to work properly
  modify_script() {
      # identify path to program binary
      binaryPath=$(cat $tmpfile | grep '^exec' | grep -o '/gnu/store/[^\"]*')
      [ "$binaryPath" = "" ] && die "exec command not found in \"$wrapperPath\"!"
      params[paramsProgramIndex]=$binaryPath

      # replace exec command in wrapper script with new firejail run prompt 
      firejailRunPrompt="firejail $profile ${params[@]}"
      sed -i "s|^exec.*|$firejailRunPrompt|" $tmpfile
      
      echo "debug: $firejailRunPrompt"

      # execute
      sh $tmpfile
  }

  ## Main
  process_params
  copy_script
  modify_script

#+end_src

*Old script*

#+begin_src shell :tangle .bin/firejail-guix-run :shebang #!/bin/sh

  ## Improved version of firejail-guix-run
  # Note: quotes in params dont work, and you need to
  # enter "--" to separate firejail params from program params.

  # create a tmpfile and delete if exit
  tmpfile=$(mktemp)
  trap 'rm -f "$tmpfile"' EXIT

  die() { echo -e "\n$* exiting..." 1>&2 ; exit 1; }

  params=( "$@" )

  # process parameters
  process_params() {
      # panic if no params
      [ "${#params[@]}" -eq 0 ] && die "no inputs provided."
      # if a separator "--" exists in the params, forward the params
      # that come before it to firejail and after it to the program.
      paramsForFirejail=()
      paramsForProgram=()
      # if "--" does NOT exist in list of params:
      if ! $(printf '%s\0' '${params[@]}' | grep -Fxqz -- '--'); then
  	for i in "${params[@]}"; do
  	    paramsForProgram+=($i)
  	done
      else
  	local passedSeparator=false
  	for i in "${params[@]}"; do
  	    if [ "$i" = "--" ]; then
  		passedSeparator=true
  		continue;
  	    fi
  	    # if loop passed the separator, add to program params.
  	    if [ "$passedSeparator" = false ]; then
  		paramsForFirejail+=($i)
  	    else
  		paramsForProgram+=($i)
  	    fi
    	done
      fi
      # get the program name
      programName="${paramsForProgram[0]}"
      # shift the values to get rid of program name from parameters
      paramsForProgram=("${paramsForProgram[@]:1}")
  }

  # manage if params contains --profile
  input_profile() {
      profile=$(printf '%s\0' '${params[@]}' | grep -Fxz -- '--profile=.*')
      if [ "$profile" = "" ]; then
  	profile="--profile=$(basename $(which $programName))"
      fi
  }

  # identify wrapper script and copy it to tmpfile
  copy_script() {
      # not sure if this is necessary but might as well
      # [ -f "$HOME/.profile" ] && . ~/.profile
      # get path to wrapper script
      wrapperPath=$(which "$programName") || die "program not found in path."
      # copy script to tmpfile
      cp $wrapperPath $tmpfile || die "cant copy wrapper script to tmpfile."
  }

  # modify the copied wrapper script to work properly
  modify_script() {
      # identify path to program binary
      binaryPath=$(cat $tmpfile | grep '^exec' | grep -o '/gnu/store/[^\"]*') \
  	|| die "exec not found in script."
      [ "$binaryPath" = "" ] && die "exec command not found in \"$wrapperPath\"!"

      # replace exec command in wrapper script with new firejail run prompt 
      firejailRunPrompt="firejail --profile=$programName ${paramsForFirejail[@]} -- $binaryPath ${paramsForProgram[@]}"
      sed -i "s|^exec.*|$firejailRunPrompt|" $tmpfile

      # execute
      sh $tmpfile
  }

  ## Main
  process_params
  input_profile
  copy_script
  modify_script

#+end_src

*Old script*

#+begin_src shell :tangle no

  ## A basic script that runs a program installed through Guix
  ## in Firejail.
  ## Usage example: "firejail-guix-run qutebrowser"
  ## To Note: firejail must first have setuid permissions
  ## (https://guix.gnu.org/manual/en/html_node/Setuid-Programs.html)

  die() { echo "$*" 1>&2 ; exit 1; }

  program="$1"
  if [ $# -eq 0 ]; then
      die "no inputs provided. exiting..."
  fi

  # not sure if this is necessary but might as well
  . ~/.profile

  # get path to wrapper script
  wrapperPath=$(which "$program") || die "program not found in path, exiting..."

  # go through each line in wrapper script with loop and execute
  while read line; do
      if [ "$(echo $line| grep -c '^#!.*')" -eq 1 ]; then
  	continue ## skip shebang
      elif [ "$(echo $line| grep -c '^exec.*')" -eq 1 ]; then
  	binPath=$(echo $line| grep -o '/gnu/store/[^\"]*')
  	# ^extracts path to the actual program binary
      else
  	$line # execute line of script
      fi
  done < $wrapperPath # load script into loop

  # if no binPath found in exec statement, then exit
  if [ "$binPath" = "" ]; then
      die "exec command not found in \"$wrapperPath\"! exiting..."
  fi

  # shift parameters over by one so that $1 (e.g. 'qutebrowser')
  # wont be included in $@
  shift
  # note: using exec will make firejail setuid complain
  firejail --profile=$program $binPath "$@"

#+end_src

*original*

#+begin_src shell :tangle no

  echo "Note: this script does not work for Nix packages, only Guix, for now..."

  program="$1"
  if [ $# -eq 0 ]; then
      echo "no inputs provided. exiting..."
      exit 1
  fi

  . ~/.profile

  whichPath=$(which "$program") \
      || echo "program not found in path, exiting..." || exit 1;

  # determine if the package is a nix program
  if [ "$(echo $whichPath| grep -c 'nix-profile')" -ge 1 ]; then
      isNixPackage=1
  else
      isNixPackage=0
  fi

  # go through each line in wrapper script with loop
  while read line; do
      if [ "$(echo $line| grep -c '^exec.*')" -eq 1 ]; then
        runPath=$(echo $line| grep -o '/gnu/store/[^\"]*')
      elif [ "$(echo $line| grep -c '^#!.*')" -eq 1 ]; then
        continue # skip shebang
      elif [ "$isNixPackage" -eq 1 ]; then
        bash -e $line
      else
        $line
      fi
  done < $whichPath # load script into loop

  ## debug
  echo "debug: wrapper path: $whichPath"
  echo "debug: exec path: $runPath"

  # if no exec match made in loop, then exit
  if [ "$runPath" = "" ]; then
      echo "exec command not found in \"$whichPath\"! exiting..."
      exit 1
  fi

  # shift parameters over by one so that $1 (e.g. 'qutebrowser')
  # wont be included in $@
  shift
  # note: using exec will make firejail setuid complain
  firejail --profile=$program $runPath "$@"

#+end_src

**** disable-common.local

#+begin_src conf-unix :tangle .config/firejail/disable-common.local

  blacklist ${HOME}/Documents/secure
  blacklist ${HOME}/School/school/Important-docs

#+end_src

**** keepassxc.local

#+begin_src conf-unix :tangle .config/firejail/keepassxc.local

  ## Browser Integration
  # So can access database and keyfile
  noblacklist ${HOME}/Documents/secure
  # Allow browser profile, required for browser integration (i think)
  # noblacklist ${HOME}/.librewolf
  # On github wiki for needed
  noblacklist ${RUNUSER}/app
  #
  ##

  ## ETC
  #
  #dbus-user.talk org.freedesktop.secrets
  #
  dbus-user.talk org.freedesktop.Notifications
  #
  ##

#+end_src

**** librewolf.local

#+begin_src conf-unix :tangle .config/firejail/librewolf.local

  #whitelist ${RUNUSER}/run/user/$UID/librewolf

  ## KeepassXC browser integration
  noblacklist ${RUNUSER}/app
  whitelist ${RUNUSER}/kpxc_server
  whitelist ${RUNUSER}/org.keepassxc.KeePassXC.BrowserServer
  #
  noblacklist ${HOME}/.mozilla
  whitelist ${HOME}/.mozilla
  #
  noblacklist ${HOME}/Documents/secure
  #

  ## ETC
  #
  # native notifications
  dbus-user.talk org.freedesktop.Notifications
  #
  # inhibiting screensavers
  dbus-user.talk org.freedesktop.ScreenSaver

#+end_src

**** firefox.profile

#+begin_src conf-unix :tangle .config/firejail/firefox.local

  ## KeepassXC browser integration
  noblacklist ${RUNUSER}/app
  whitelist ${RUNUSER}/kpxc_server
  whitelist ${RUNUSER}/org.keepassxc.KeePassXC.BrowserServer

  ## ETC
  #
  # native notifications
  dbus-user.talk org.freedesktop.Notifications
  #
  # inhibiting screensavers
  dbus-user.talk org.freedesktop.ScreenSaver

  # fixes sound?
  # include firefox-common-addons.profile
  # whitelist ${RUNUSER}/pulse
  # ignore whitelist ${RUNUSER}/*firefox*

#+end_src

**** firefox-common-addons.profile

#+begin_src conf-unix :tangle .config/firejail/firefox-common-addons.local

  # fixes audio problem
  # whitelist ${RUNUSER}/pulse

#+end_src

**** steam.local

#+begin_src conf-unix :tangle .config/firejail/steam.local

  #ignore seccomp

  # private-bin is disabled while in testing, but is known to work with multiple games.
  # Add the next line to your steam.local to enable private-bin.
  #private-bin awk,basename,bash,bsdtar,bzip2,cat,chmod,cksum,cmp,comm,compress,cp,curl,cut,date,dbus-launch,dbus-send,desktop-file-edit,desktop-file-install,desktop-file-validate,dirname,echo,env,expr,file,find,getopt,grep,gtar,gzip,head,hostname,id,lbzip2,ldconfig,ldd,ln,ls,lsb_release,lsof,lspci,lz4,lzip,lzma,lzop,md5sum,mkdir,mktemp,mv,netstat,ps,pulseaudio,python*,readlink,realpath,rm,sed,sh,sha1sum,sha256sum,sha512sum,sleep,sort,steam,steamdeps,steam-native,steam-runtime,sum,tail,tar,tclsh,test,touch,tr,umask,uname,update-desktop-database,wc,wget,wget2,which,whoami,xterm,xz,zenity

  # To view screenshots add the next line to your steam.local.
  #private-bin eog,eom,gthumb,pix,viewnior,xviewer

#+end_src

* Desktop Guix profile

*.config/guix/manifests/desktop.scm:*

#+begin_src scheme :tangle .config/guix/manifests/desktop.scm :noweb yes

  (specifications->manifest
   '(
     <<packages>>
     ))

#+end_src

* Workstation Guix profile

*.config/guix/manifests/workstation.scm:*

#+begin_src scheme :tangle .config/guix/manifests/workstation.scm :noweb yes

  (specifications->manifest
   '(
     <<workstation>>
     ))

#+end_src

* Provide the ri-desktop package

#+begin_src emacs-lisp

  ;; THIS DOESN'T WORK!
  (provide 'ri-desktop)

#+end_src
