dotfiles/emacs-old/.config/oldmacs.d/lisp/ri-desktop.el

;; THIS DOESN'T WORK!
(provide 'ri-desktop)
